fobe-projects/fobe-esp32-arduino/boards.txt
esp32.menu.CPUFreq.240=240MHz (WiFi/BT)
esp32.menu.CPUFreq.240.build.f_cpu=240000000L
esp32.menu.CPUFreq.160=160MHz (WiFi/BT)
esp32.menu.CPUFreq.160.build.f_cpu=160000000L
esp32.menu.CPUFreq.80=80MHz (WiFi/BT)
esp32.menu.CPUFreq.80.build.f_cpu=80000000L
esp32.menu.CPUFreq.40=40MHz (40MHz XTAL)
esp32.menu.CPUFreq.40.build.f_cpu=40000000L
esp32.menu.CPUFreq.26=26MHz (26MHz XTAL)
esp32.menu.CPUFreq.26.build.f_cpu=26000000L
esp32.menu.CPUFreq.20=20MHz (40MHz XTAL)
esp32.menu.CPUFreq.20.build.f_cpu=20000000L
esp32.menu.CPUFreq.13=13MHz (26MHz XTAL)
esp32.menu.CPUFreq.13.build.f_cpu=13000000L
esp32.menu.CPUFreq.10=10MHz (40MHz XTAL)
esp32.menu.CPUFreq.10.build.f_cpu=10000000L

esp32.menu.FlashMode.qio=QIO
esp32.menu.FlashMode.qio.build.flash_mode=dio
esp32.menu.FlashMode.qio.build.boot=qio
esp32.menu.FlashMode.dio=DIO
esp32.menu.FlashMode.dio.build.flash_mode=dio
esp32.menu.FlashMode.dio.build.boot=dio

esp32.menu.FlashFreq.80=80MHz
esp32.menu.FlashFreq.80.build.flash_freq=80m
esp32.menu.FlashFreq.40=40MHz
esp32.menu.FlashFreq.40.build.flash_freq=40m

esp32.menu.FlashSize.4M=4MB (32Mb)
esp32.menu.FlashSize.4M.build.flash_size=4MB
esp32.menu.FlashSize.8M=8MB (64Mb)
esp32.menu.FlashSize.8M.build.flash_size=8MB
esp32.menu.FlashSize.2M=2MB (16Mb)
esp32.menu.FlashSize.2M.build.flash_size=2MB
esp32.menu.FlashSize.16M=16MB (128Mb)
esp32.menu.FlashSize.16M.build.flash_size=16MB

esp32.menu.UploadSpeed.921600=921600
esp32.menu.UploadSpeed.921600.upload.speed=921600
esp32.menu.UploadSpeed.115200=115200
esp32.menu.UploadSpeed.115200.upload.speed=115200
esp32.menu.UploadSpeed.256000.windows=256000
esp32.menu.UploadSpeed.256000.upload.speed=256000
esp32.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32.menu.UploadSpeed.230400=230400
esp32.menu.UploadSpeed.230400.upload.speed=230400
esp32.menu.UploadSpeed.460800.linux=460800
esp32.menu.UploadSpeed.460800.macosx=460800
esp32.menu.UploadSpeed.460800.upload.speed=460800
esp32.menu.UploadSpeed.512000.windows=512000
esp32.menu.UploadSpeed.512000.upload.speed=512000

esp32.menu.LoopCore.1=Core 1
esp32.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
esp32.menu.LoopCore.0=Core 0
esp32.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

esp32.menu.EventsCore.1=Core 1
esp32.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
esp32.menu.EventsCore.0=Core 0
esp32.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

esp32.menu.DebugLevel.none=None
esp32.menu.DebugLevel.none.build.code_debug=0
esp32.menu.DebugLevel.error=Error
esp32.menu.DebugLevel.error.build.code_debug=1
esp32.menu.DebugLevel.warn=Warn
esp32.menu.DebugLevel.warn.build.code_debug=2
esp32.menu.DebugLevel.info=Info
esp32.menu.DebugLevel.info.build.code_debug=3
esp32.menu.DebugLevel.debug=Debug
esp32.menu.DebugLevel.debug.build.code_debug=4
esp32.menu.DebugLevel.verbose=Verbose
esp32.menu.DebugLevel.verbose.build.code_debug=5

esp32.menu.EraseFlash.none=Disabled
esp32.menu.EraseFlash.none.upload.erase_cmd=
esp32.menu.EraseFlash.all=Enabled
esp32.menu.EraseFlash.all.upload.erase_cmd=-e

esp32.menu.ZigbeeMode.default=Disabled
esp32.menu.ZigbeeMode.default.build.zigbee_mode=
esp32.menu.ZigbeeMode.default.build.zigbee_libs=
esp32.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
esp32.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
esp32.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote

##############################################################

 # FoBE Quill ESP32S3 Mesh FH4R2

 fobe_quill_esp32s3_mesh.name=FoBE Quill ESP32S3 Mesh
 fobe_quill_esp32s3_mesh.vid.0=0x303a
 fobe_quill_esp32s3_mesh.pid.0=0x82f4
 fobe_quill_esp32s3_mesh.vid.1=0x303a
 fobe_quill_esp32s3_mesh.vid.1=0x82f5
 fobe_quill_esp32s3_mesh.vid.2=0x303a
 fobe_quill_esp32s3_mesh.pid.2=0x82f6

 fobe_quill_esp32s3_mesh.bootloader.tool=esptool_py
 fobe_quill_esp32s3_mesh.bootloader.tool.default=esptool_py

 fobe_quill_esp32s3_mesh.upload.tool=esptool_py
 fobe_quill_esp32s3_mesh.upload.tool.default=esptool_py
 fobe_quill_esp32s3_mesh.upload.tool.network=esp_ota

 fobe_quill_esp32s3_mesh.upload.maximum_size=1310720
 fobe_quill_esp32s3_mesh.upload.maximum_data_size=327680
 fobe_quill_esp32s3_mesh.upload.flags=
 fobe_quill_esp32s3_mesh.upload.extra_flags=
 adafruit_feather_esp32s3.upload.use_1200bps_touch=true
 adafruit_feather_esp32s3.upload.wait_for_upload_port=true

 fobe_quill_esp32s3_mesh.serial.disableDTR=false
 fobe_quill_esp32s3_mesh.serial.disableRTS=false

 fobe_quill_esp32s3_mesh.build.tarch=xtensa
 fobe_quill_esp32s3_mesh.build.bootloader_addr=0x0
 fobe_quill_esp32s3_mesh.build.target=esp32s3
 fobe_quill_esp32s3_mesh.build.mcu=esp32s3
 fobe_quill_esp32s3_mesh.build.core=esp32
 fobe_quill_esp32s3_mesh.build.variant=fobe_quill_esp32s3_mesh
 fobe_quill_esp32s3_mesh.build.board=fobe_quill_esp32s3_mesh

 fobe_quill_esp32s3_mesh.build.usb_mode=0
 fobe_quill_esp32s3_mesh.build.cdc_on_boot=1
 fobe_quill_esp32s3_mesh.build.msc_on_boot=0
 fobe_quill_esp32s3_mesh.build.dfu_on_boot=0
 fobe_quill_esp32s3_mesh.build.f_cpu=240000000L
 fobe_quill_esp32s3_mesh.build.flash_size=4MB
 fobe_quill_esp32s3_mesh.build.flash_freq=80m
 fobe_quill_esp32s3_mesh.build.flash_mode=qio
 fobe_quill_esp32s3_mesh.build.boot=qio
 fobe_quill_esp32s3_mesh.build.boot_freq=80m
 fobe_quill_esp32s3_mesh.build.partitions=ffat
 fobe_quill_esp32s3_mesh.build.defines=
 fobe_quill_esp32s3_mesh.build.loop_core=
 fobe_quill_esp32s3_mesh.build.event_core=
 fobe_quill_esp32s3_mesh.build.psram_type=qspi
 fobe_quill_esp32s3_mesh.build.memory_type={build.boot}_{build.psram_type}

 fobe_quill_esp32s3_mesh.menu.JTAGAdapter.default=Disabled
 fobe_quill_esp32s3_mesh.menu.JTAGAdapter.default.build.copy_jtag_files=0
 fobe_quill_esp32s3_mesh.menu.JTAGAdapter.builtin=Integrated USB JTAG
 fobe_quill_esp32s3_mesh.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
 fobe_quill_esp32s3_mesh.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
 fobe_quill_esp32s3_mesh.menu.JTAGAdapter.external=FTDI Adapter
 fobe_quill_esp32s3_mesh.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
 fobe_quill_esp32s3_mesh.menu.JTAGAdapter.external.build.copy_jtag_files=1
 fobe_quill_esp32s3_mesh.menu.JTAGAdapter.bridge=ESP USB Bridge
 fobe_quill_esp32s3_mesh.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
 fobe_quill_esp32s3_mesh.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

 fobe_quill_esp32s3_mesh.menu.PSRAM.disabled=Disabled
 fobe_quill_esp32s3_mesh.menu.PSRAM.disabled.build.defines=
 fobe_quill_esp32s3_mesh.menu.PSRAM.disabled.build.psram_type=qspi
 fobe_quill_esp32s3_mesh.menu.PSRAM.enabled=QSPI PSRAM
 fobe_quill_esp32s3_mesh.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
 fobe_quill_esp32s3_mesh.menu.PSRAM.enabled.build.psram_type=qspi

 fobe_quill_esp32s3_mesh.menu.FlashMode.qio=QIO 80MHz
 fobe_quill_esp32s3_mesh.menu.FlashMode.qio.build.flash_mode=dio
 fobe_quill_esp32s3_mesh.menu.FlashMode.qio.build.boot=qio
 fobe_quill_esp32s3_mesh.menu.FlashMode.qio.build.boot_freq=80m
 fobe_quill_esp32s3_mesh.menu.FlashMode.qio.build.flash_freq=80m
 fobe_quill_esp32s3_mesh.menu.FlashMode.dio=DIO 80MHz
 fobe_quill_esp32s3_mesh.menu.FlashMode.dio.build.flash_mode=dio
 fobe_quill_esp32s3_mesh.menu.FlashMode.dio.build.boot=dio
 fobe_quill_esp32s3_mesh.menu.FlashMode.dio.build.boot_freq=80m
 fobe_quill_esp32s3_mesh.menu.FlashMode.dio.build.flash_freq=80m

 fobe_quill_esp32s3_mesh.menu.FlashSize.4M=4MB (32Mb)
 fobe_quill_esp32s3_mesh.menu.FlashSize.4M.build.flash_size=4MB

 fobe_quill_esp32s3_mesh.menu.LoopCore.1=Core 1
 fobe_quill_esp32s3_mesh.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
 fobe_quill_esp32s3_mesh.menu.LoopCore.0=Core 0
 fobe_quill_esp32s3_mesh.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

